# Parameters1
nc: 2 # number of classes
ch: 6
kpt_shape: [2, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# DEYOLO backbone
backbone:
  - [-1, 1, IdentityInput, []] # 0
  - [-1, 1, ModalitySelector, [1]] # 1 RGB
  - [-2, 1, ModalitySelector, [2]] # 2 IR

  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 6-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 8-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 12
  - [-1, 2, C2PSA, [1024]] # 13

  - [2, 1, Conv, [64, 3, 2]] # 14-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 15-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 17-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 19-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 21-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 23
  - [-1, 2, C2PSA, [1024]] # 24

# DEYOLO head
head:
  - [[7, 18], 1, Concat, [1]] # 25
  - [[9, 20], 1, Concat, [1]] # 26
  - [[13, 24], 1, Concat, [1]] # 27

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 26], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 30

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 25], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 33 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 30], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 36 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 27], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 39 (P5/32-large)

  - [[33, 36, 39], 1, Pose, [nc, kpt_shape]] # Detect(P3, P4, P5)
