# Parameters
ch: 6
nc: 2  # number of classes
kpt_shape: [2, 3]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales:  # model compound scaling constants, i.e. 'model=yolov11n.yaml' will call yolov8.yaml with scale 'n'
# [depth, width, max_channels]
n: [0.50, 0.25, 1024]  # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
s: [0.50, 0.50, 1024]  # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
m: [0.50, 1.00, 512]  # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
l: [1.00, 1.00, 512]  # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
x: [1.00, 1.50, 512]  # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO-Fuse backbone
backbone:
# [from, repeats, module, args]
- [-1, 1, IdentityInput, []]  # 0
- [-1, 1, ModalitySelector, [1]]  # 1 RGB
- [-2, 1, ModalitySelector, [2]]  # 2 IR

- [-2, 1, Conv, [64, 3, 2]]  # 3-P1/2
- [-2, 1, Conv, [64, 3, 2]]  # 4-P1/2

- [-2, 1, Conv, [128, 3, 2]]  # 5-P2/4 <-- S2 P2/4 "纯净"特征源头
- [-2, 1, Conv, [128, 3, 2]]  # 6-P2/4

- [-2, 2, C3k2_LFEM, [256, False, 0.25]]  # 7
- [-2, 2, C3k2, [256, False, 0.25]]  # 8

- [[-2, -1], 1, Concat, [1]]  # 9

- [-1, 1, Conv, [256, 3, 2]]  # 10-P3/8
- [-3, 1, Conv, [256, 3, 2]]

- [-2, 2, C3k2_LFEM, [512, False, 0.25]]  # 12
- [-2, 2, C3k2, [512, False, 0.25]]

- [[-2, -1], 1, Concat, [1]]  # 14 (head P3 from here)

- [-1, 1, Conv, [512, 3, 2]]  # 15-P4/16
- [-3, 1, Conv, [512, 3, 2]]

- [-2, 2, C3k2_LFEM, [512, True]]  # 17
- [-2, 2, C3k2, [512, True]]

- [[-2, -1], 1, Concat, [1]]  # 19 (head P4 from here)

- [-1, 1, Conv, [1024, 3, 2]]  # 20-P5/32

# --- MODIFICATION START (S2-S2 Fusion) ---
# 原21层(S1 Conv)和原23层(S1 C3k2)已被删除。

# 原22层现在是第 21 层
- [-1, 2, C3k2_LFEM, [1024, True]]  # 21 <-- "深层S2专家"特征 (原22层)

# 新分支开始
- [5, 1, Conv, [256, 3, 2]]  # 22 (P2->P3)
- [-1, 1, Conv, [512, 3, 2]]  # 23 (P3->P4)
- [-1, 1, Conv, [1024, 3, 2]]  # 24 (P4->P5)
- [-1, 2, C3k2_LFEM, [1024, True]]  # 25 <-- "纯净S2专家"特征

# 融合 "深层S2" (第21层) 和 "纯净S2" (第25层)
- [[21, 25], 1, Concat, [1]]  # 26 (索引已修正)
# --- MODIFICATION END ---

- [-1, 1, SPPF, [1024, 5]]  # 27
- [-1, 2, C2PSA, [1024]]  # 28 (head P5 from here)

# YOLO-Fuse head (索引已自动更新)
head:
- [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 29
- [[-1, 19], 1, Concat, [1]]  # 30 (cat backbone P4 at 19)
- [-1, 2, C3k2, [512, False]]  # 31

- [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 32
- [[-1, 14], 1, Concat, [1]]  # 33 (cat backbone P3 at 14)
- [-1, 2, C3k2, [256, False]]  # 34 (P3/8-small)

- [-1, 1, Conv, [256, 3, 2]]  # 35
- [[-1, 31], 1, Concat, [1]]  # 36 (cat head P4 from 31)
- [-1, 2, C3k2, [512, False]]  # 37 (P4/16-medium)

- [-1, 1, Conv, [512, 3, 2]]  # 38
- [[-1, 28], 1, Concat, [1]]  # 39 (cat head P5 from 28)
- [-1, 2, C3k2, [1024, True]]  # 40 (P5/32-large)

- [[34, 37, 40], 1, Pose, [nc, kpt_shape]]  # 41 (Detect(P3, P4, P5))