# Parameters
ch: 6
nc: 2 # number of classes
kpt_shape: [2, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov11n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO-Fuse backbone
backbone:
# [from, repeats, module, args]
- [-1, 1, IdentityInput, []] # 0
- [-1, 1, ModalitySelector, [1]] # 1 RGB
- [-2, 1, ModalitySelector, [2]] # 2 IR

- [-2, 1, Conv, [64, 3, 2]] # 3-P1/2
- [-2, 1, Conv, [64, 3, 2]]

- [-2, 1, Conv, [128, 3, 2]] # 5-P2/4
- [-2, 1, Conv, [128, 3, 2]]

- [-2, 2, C3k2_LFEM, [256, True]] # 7  g
- [-2, 2, C3k2, [256, False, 0.25]]

- [[-2, -1], 1, Concat, [1]] # 9

- [-1, 1, Conv, [256, 3, 2]] # 10-P3/8
- [-3, 1, Conv, [256, 3, 2]]

- [-2, 2, C3k2_LFEM, [512, False, 0.25]] # 12  b
- [-2, 2, C3k2, [512, False, 0.25]]

- [[-2, -1], 1, Concat, [1]] # 14

- [-1, 1, Conv, [512, 3, 2]] # 15-P4/16
- [-3, 1, Conv, [512, 3, 2]]

- [-2, 2, C3k2_LFEM, [512, True]] # 17  g
- [-2, 2, C3k2, [512, True]]

- [[-2, -1], 1, Concat, [1]] # 19

- [-1, 1, Conv, [1024, 3, 2]]  # 20-P5/32

# --- MODIFICATION START (S2-S2 Fusion) ---
# 原21层(S1 Conv)和原23层(S1 C3k2)已被删除。

# 原22层现在是第 21 层
- [-1, 2, C3k2_LFEM, [1024, False, 0.25]]  # 21 <-- "深层S2专家"特征 (原22层) b

# 新分支开始
- [5, 1, NearestZeroPad, [1024]]  # 22 (P2->P3)


# 融合 "深层S2" (第21层) 和 "纯净S2" (第25层)
- [[21, 22], 1, Concat, [1]]  # 23 (索引已修正)
# --- MODIFICATION END ---

- [-1, 1, SPPF, [1024, 5]]  # 24
- [-1, 2, C2PSA, [1024]]  # 25 (head P5 from here)

# YOLO-Fuse head (索引已自动更新)
head:
- [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 26
- [[-1, 19], 1, Concat, [1]]  # 27 (cat backbone P4 at 19)
- [-1, 2, C3k2, [512, False]]  # 28

- [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 29
- [[-1, 14], 1, Concat, [1]]  # 30 (cat backbone P3 at 14)
- [-1, 2, C3k2, [256, False]]  # 31 (P3/8-small)

- [-1, 1, Conv, [256, 3, 2]]  # 32
- [[-1, 28], 1, Concat, [1]]  # 33 (cat head P4 from 31)
- [-1, 2, C3k2, [512, False]]  # 34 (P4/16-medium)

- [-1, 1, Conv, [512, 3, 2]]  # 35
- [[-1, 25], 1, Concat, [1]]  # 36 (cat head P5 from 28)
- [-1, 2, C3k2, [1024, True]]  # 37 (P5/32-large)

- [[31, 34, 37], 1, Pose, [nc, kpt_shape]]  # 38 (Detect(P3, P4, P5))